In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({'categorical': pd.Categorical(['d', 'e', 'f']),
                'numeric': [1, 2, 3],
                'object': ['a', 'b', 'c']
                })
df

  categorical  numeric object
0           d        1      a
1           e        2      b
2           f        3      c

In [67]:
g = df.groupby('gender')
g.mean()

         person_id          wage
gender
0       487.769076  40855.747261
1       505.271654  46815.944005

In [65]:
df.iloc[28]

person_id       22.000000
gender           1.000000
wage         92721.847914
Name: 28, dtype: float64

In [68]:
g.count()

        person_id  wage
gender
0             498   498
1             508   508

In [70]:
df.groupby('gender').max()

        person_id           wage
gender
0             997  436170.404059
1             999  755320.874132